{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2019)",
        "GPA: 3.49/4"
      ],
      "degree": "Post-Baccalaureate of Computer Information Systems (Emerging Tech)",
      "department": "Computing Studies \u0026 Information Systems",
      "duration": "2019-2022",
      "school_name": "Douglas College"
    },
    {
      "awards_achievements": [
        "Second Class, Division One/Upper Second Class"
      ],
      "degree": "Bachelors in Computer Science",
      "department": "Electrical and Computer Engineering",
      "duration": "2014-2017",
      "school_name": "Nottingham Malaysia"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ShankarenfoDharma",
  "highlighted_projects": [
    {
      "description": "Created a web application NotePack, for usage by students in an online environment to promote note-taking, studying, organization and communication. Deployed using Flask-Python, with SQL database implementation. Each user has access to individual repository for quick upload/downloads, in-app notepad, chat system and a book recommendation system. Login can also be achieved using facecam capture.",
      "git_url": "https://github.com/ShankarenfoPannagianiDharma/NotePack",
      "name": "NotePack WebApp"
    },
    {
      "description": "Built an Android game application for a student's debate game. Using MongoDB, Java and Python, a group of students may enter a debate game where they support or contest a controversial statement. Throughout the game, players (arbitrated by the teacher) try to convince the opposition of their side through arguments on releveant subtopics.",
      "git_url": "https://github.com/ShankarenfoPannagianiDharma/CSIS4280-TugOfLogic-Group4",
      "name": "Tug-of-logic"
    },
    {
      "description": "Built an Android app for personal use. The budget app allows user to record expenditures (entered manually), which are recorded and summed by monthly intervals. Records are saved into local files of the App, and can be deleted by user's volition.",
      "git_url": "https://github.com/ShankarenfoPannagianiDharma/WotIsMyBudget",
      "name": "WotIsMyBudget"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Deployed a script-based monitoring tool. Project utilizes PSQL container for database access, which is used to log host device information and device performance (via memory). Using bash and sql scripts, Crontab enables automatic logging of JRD performance into the PSQL table, with SQL queries displaying useful information regarding performance and recorded logs.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Built a java CLI App utilizing Twitter 1.1 API to allow creation, retrieval and deletion of tweets. Utilizing Springboot as a base, the application runs on three-layer architecture of DAO, Service and Controller modules to access and communicate with twitter's API. Project can be deployed via dockerfile and also prepared in github.",
        "JDBC App: Created a java application that demonstrates usage of JDBC, including the use of JDBC driver, connections, DAOs and DTOs. DAO operations include queries for SQL with grouping, conditionals and multiple joins.",
        "Grep App: Deployed a java application emulating 'grep' functionality of bash. Application uses buffered reader/writer and stream API to process files. Application differs from bash grep as it accepts a folder url as source, which will access all files located under that folder for matching, and forces an output file for result of operation. Application can be accessed in target/grep-1.0-SNAPSHOT.jar through javac."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Shankarenfo Pannagiani Dharma",
  "others": [
    {
      "bullets": [
        "PC Gaming",
        "Violin Player",
        "Creative Writing/Reading"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Collaborated in an Agile Scrum environment for various Jarvis applications and projects. Projects involve usage of Dockers and containers, as well as Maven, IntelliJ, PSQL and various APIs. Scrum development methodology requires daily scrum meetings with team members, as well as 2-week sprint ending with a retrospective to coordinate and measure progress.",
      "duration": "2022-present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "Linux/Bash",
      "C++/C#",
      "Javascript",
      "HTML/CSS",
      "Flask"
    ],
    "familiar": [
      "Python",
      "GCP",
      "JSON",
      "R Data Mining",
      "Machine Learning"
    ],
    "proficient": [
      "Java",
      "Android Programming",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a recent graduate from Douglas College, and am undergoing further training in Jarvis as a software development engineer, learning advanced techniques in Java such as Stream API, JDBC, dockers and containers and JSON APIs. I have also become familiar with Android development, aslongside Python Flask coding through my school studies. The software development world is ever-changing, constantly improving and iterating over itself, improving and growing towards more impressive feats. I love being in that current of self-improvement, learning new techniques, skills and methods as technology advances. I enjoy puzzling out software logic of the real world- how systems would have to behave, what alternatives there should be, and how it is all implemented."
}
